apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u585xx_rcc.h
/* RCC PLL1 configuration register */

#define RCC_PLL1CFGR_PLL1SRC_SHIFT        (0)                               /* Bits 0-1: PLL1 entry clock source */
#define RCC_PLL1CFGR_PLL1SRC_MASK         (3 << RCC_PLL1CFGR_PLL1SRC_SHIFT)
#define RCC_PLL1CFGR_PLL1SRC_NONE         (0 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 00: No clock send to PLL1 */
#define RCC_PLL1CFGR_PLL1SRC_MSIS         (1 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 01: MSIS clock selected as PLL1 clock entry */
#define RCC_PLL1CFGR_PLL1SRC_HSI16        (2 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 10: HSI16 clock selected as PLL1 clock entry */
#define RCC_PLL1CFGR_PLL1SRC_HSE          (3 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 11: HSE clock selected as PLL1 clock entry */
#define RCC_PLL1CFGR_PLL1RGE_SHIFT        (2)                               /* Bits 2-3: PLL1 input frequency range */
#define RCC_PLL1CFGR_PLL1RGE_MASK         (3 << RCC_PLL1CFGR_PLL1RGE_SHIFT)
#define RCC_PLL1CFGR_PLL1RGE_4_TO_8MHZ    (0 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 00-01-10: PLL1 input (ref1_ck) clock range frequency between 4 and 8 MHz */
#define RCC_PLL1CFGR_PLL1RGE_8_TO_16MHZ   (3 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 11: PLL1 input (ref1_ck) clock range frequeny between 8 and 16 MHz */
#define RCC_PLL1CFGR_PLL1FRACEN           (1 << 4)                          /* Bit 4: PLL1 fractional latch enable */
#define RCC_PLL1CFGR_PLL1M_SHIFT          (8)                               /* Bits 8-11: Prescaler for PLL1 */
#define RCC_PLL1CFGR_PLL1M_MASK           (0xf << RCC_PLL1CFGR_PLL1M_SHIFT)
#define RCC_PLL1CFGR_PLL1M(n)             (((n) - 1) << RCC_PLL1CFGR_PLL1M_SHIFT)
#define RCC_PLL1CFGR_PLL1MBOOST_SHIFT     (12)                              /* Bits 12-15: Prescaler for EPOD booster input clock */
#define RCC_PLL1CFGR_PLL1MBOOST_MASK      (0xf << RCC_PLL1CFGR_PLL1MBOOST_SHIFT)
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_1     (0 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0000: division by 1 (bypass) */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_2     (1 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0001: division by 2 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_4     (2 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0010: division by 4 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_6     (3 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0011: division by 6 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_8     (4 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0100: division by 8 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_10    (5 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0101: division by 10 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_12    (6 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0110: division by 12 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_14    (7 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 0111: division by 14 */
#define RCC_PLL1CFGR_PLL1MBOOST_DIV_16    (8 << RCC_PLL1CFGR_PLL1MBOOST_SHIFT) /* 1000: division by 16 */
#define RCC_PLL1CFGR_PLL1PEN              (1 << 16)                            /* Bit 16: PLL1 DIVP divider output enable */
#define RCC_PLL1CFGR_PLL1QEN              (1 << 17)                            /* Bit 17: PLL1 DIVQ divider output enable */
#define RCC_PLL1CFGR_PLL1REN              (1 << 18)                            /* Bit 18: PLL1 DIVR divider output enable */

/* RCC PLL1 dividers register */

#define RCC_PLL1DIVR_PLL1N_SHIFT          (0)       /* Bits 0-8: Multiplication factor for PLL1 VCO */
#define RCC_PLL1DIVR_PLL1N_MASK           (0x1ff << RCC_PLL1DIVR_PLL1N_SHIFT)
#define RCC_PLL1DIVR_PLL1N(n)             (((n) - 1) << RCC_PLL1DIVR_PLL1N_SHIFT)
#define RCC_PLL1DIVR_PLL1P_SHIFT          (9)       /* Bits 9-15: PLL1 DIVP division factor */
#define RCC_PLL1DIVR_PLL1P_MASK           (0x7f << RCC_PLL1DIVR_PLL1P_SHIFT)
#define RCC_PLL1DIVR_PLL1P(n)             (((n) - 1) << RCC_PLL1DIVR_PLL1P_SHIFT)
#define RCC_PLL1DIVR_PLL1Q_SHIFT          (16)      /* Bits 16-22: PLL1 DIVQ division factor */
#define RCC_PLL1DIVR_PLL1Q_MASK           (0x7f << RCC_PLL1DIVR_PLL1Q_SHIFT)
#define RCC_PLL1DIVR_PLL1Q(n)             (((n) - 1) << RCC_PLL1DIVR_PLL1Q_SHIFT)
#define RCC_PLL1DIVR_PLL1R_SHIFT          (24)      /* Bits 24-30: PLL1 DIVR division factor */
#define RCC_PLL1DIVR_PLL1R_MASK           (0x7f << RCC_PLL1DIVR_PLL1R_SHIFT)
#define RCC_PLL1DIVR_PLL1R(n)             (((n) - 1) << RCC_PLL1DIVR_PLL1R_SHIFT)

/* APB2 peripheral reset register */

#define RCC_APB2RSTR_TIM1RST              (1 << 11) /* Bit 11: TIM1 reset */
#define RCC_APB2RSTR_SPI1RST              (1 << 12) /* Bit 12: SPI1 reset */
#define RCC_APB2RSTR_TIM8RST              (1 << 13) /* Bit 13: TIM8 reset */
#define RCC_APB2RSTR_USART1RST            (1 << 14) /* Bit 14: USART1 reset */
#define RCC_APB2RSTR_TIM15RST             (1 << 16) /* Bit 16: TIM15 reset */
#define RCC_APB2RSTR_TIM16RST             (1 << 17) /* Bit 17: TIM16 reset */
#define RCC_APB2RSTR_TIM17RST             (1 << 18) /* Bit 18: TIM17 reset */
#define RCC_APB2RSTR_SAI1RST              (1 << 21) /* Bit 21: SAI1 reset */
#define RCC_APB2RSTR_SAI2RST              (1 << 22) /* Bit 22: SAI2 reset */

/* AHB1 Peripheral Clock enable register */

#define RCC_AHB1ENR_GPDMA1EN              (1 << 0)  /* Bit 0:  GPDMA1 clock enable */
#define RCC_AHB1ENR_CORDICEN              (1 << 1)  /* Bit 1:  CORDIC clock enable */
#define RCC_AHB1ENR_FMACEN                (1 << 2)  /* Bit 2:  FMAC clock enable */
#define RCC_AHB1ENR_MDF1EN                (1 << 2)  /* Bit 2:  MDF1 clock enable */
#define RCC_AHB1ENR_FLASHEN               (1 << 8)  /* Bit 8:  Flash memory interface clock enable */
#define RCC_AHB1ENR_CRCEN                 (1 << 12) /* Bit 12: CRC clock enable */
#define RCC_AHB1ENR_TSCEN                 (1 << 16) /* Bit 16: Touch Sensing Controller enable */
#define RCC_AHB1ENR_RAMCFGCEN             (1 << 17) /* Bit 17: RAMCFG clock enable */
#define RCC_AHB1ENR_DMA2DEN               (1 << 18) /* Bit 18: DMA2D clock enable */
#define RCC_AHB1ENR_GTZC1EN               (1 << 24) /* Bit 24: GTZC1 clock enable */
#define RCC_AHB1ENR_BKPSRAMEN             (1 << 31) /* Bit 31: BKPUPSRAM clock enable */
#define RCC_AHB1ENR_DCACHE1EN             (1 << 30) /* Bit 30: DCACHE1 clock enable */
#define RCC_AHB1ENR_SRAM1EN               (1 << 31) /* Bit 31: SRAM1 clock enable */

/* AHB2 Peripheral Clock enable register 1 */

