apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u585xx_rcc.h
#define RCC_AHB2ENR1_GPIOEN(n)            (1 << (n))
#define RCC_AHB2ENR1_GPIOAEN              (1 << 0)  /* Bit 0:  IO port A enable */
#define RCC_AHB2ENR1_GPIOBEN              (1 << 1)  /* Bit 1:  IO port B enable */
#define RCC_AHB2ENR1_GPIOCEN              (1 << 2)  /* Bit 2:  IO port C enable */
#define RCC_AHB2ENR1_GPIODEN              (1 << 3)  /* Bit 3:  IO port D enable */
#define RCC_AHB2ENR1_GPIOEEN              (1 << 4)  /* Bit 4:  IO port E enable */
#define RCC_AHB2ENR1_GPIOFEN              (1 << 5)  /* Bit 5:  IO port F enable */
#define RCC_AHB2ENR1_GPIOGEN              (1 << 6)  /* Bit 6:  IO port G enable */
#define RCC_AHB2ENR1_GPIOHEN              (1 << 7)  /* Bit 7:  IO port H enable */
#define RCC_AHB2ENR1_GPIOIEN              (1 << 8)  /* Bit 8:  IO port I enable */
#define RCC_AHB2ENR1_ADC1EN               (1 << 10) /* Bit 10: ADC1 interface enable */
#define RCC_AHB2ENR1_DCMI_PCSSI_EN        (1 << 12) /* Bit 12: DCMI and PSSI enable */
#define RCC_AHB2ENR1_OTGEN                (1 << 14) /* Bit 14: OTG_FS module enable */
#define RCC_AHB2ENR1_AESEN                (1 << 16) /* Bit 16: AES Cryptographic module enable */
#define RCC_AHB2ENR1_HASHEN               (1 << 17) /* Bit 17: HASH module enable */
#define RCC_AHB2ENR1_RNGEN                (1 << 18) /* Bit 18: Random number generator module enable */
#define RCC_AHB2ENR1_PKAEN                (1 << 19) /* Bit 19: PKA clock enable */
#define RCC_AHB2ENR1_SAESEN               (1 << 20) /* Bit 20: SAES clock enable */
#define RCC_AHB2ENR1_OCTOSPIMEN           (1 << 21) /* Bit 21: OCTOSPIM clock enable */
#define RCC_AHB2ENR1_OTFDEC1EN            (1 << 23) /* Bit 21: OTFDEC1 clock enable */
#define RCC_AHB2ENR1_OTFDEC2EN            (1 << 24) /* Bit 21: OTFDEC2 clock enable */
#define RCC_AHB2ENR1_SDMMC1EN             (1 << 27) /* Bit 27: SDMMC1 clock enable */
#define RCC_AHB2ENR1_SDMMC2EN             (1 << 28) /* Bit 28: SDMMC2 clock enable */
#define RCC_AHB2ENR1_SRAM2EN              (1 << 30) /* Bit 30: SRAM2 clock enable */
#define RCC_AHB2ENR1_SRAM3EN              (1 << 31) /* Bit 31: SRAM3 clock enable */

/* AHB2 Peripheral Clock enable register 2 */

#define RCC_AHB2ENR2_FSMCEN               (1 << 0)  /* Bit 0: FSMC clock enable */
#define RCC_AHB2ENR2_OCTOSPI1EN           (1 << 4)  /* Bit 4: OCTOSPI1 clock enable */
#define RCC_AHB2ENR2_OCTOSPI2EN           (1 << 8)  /* Bit 8: OCTOSPI2 clock enable */

/* RCC AHB3 peripheral clock enable register */

#define RCC_AHB3ENR_LPGPIO1EN             (1 << 0)  /* Bit 0: LPGPIO1 clock enable */
#define RCC_AHB3ENR_PWREN                 (1 << 2)  /* Bit 2: PWR clock enable */
#define RCC_AHB3ENR_ADC4EN                (1 << 5)  /* Bit 5: ADC4 clock enable */
#define RCC_AHB3ENR_DAC1EN                (1 << 6)  /* Bit 6: DAC1 clock enable */
#define RCC_AHB3ENR_LPDMA1EN              (1 << 9)  /* Bit 9: LPDMA1 clock enable */
#define RCC_AHB3ENR_ADF1EN                (1 << 10) /* Bit 10: ADF1 clock enable */
#define RCC_AHB3ENR_GTZC2EN               (1 << 12) /* Bit 12: GTZC2 clock enable */
#define RCC_AHB3ENR_SRAM4EN               (1 << 31) /* Bit 31: SRAM4 clock enable */

/* APB1 Peripheral Clock enable register 1 */

#define RCC_APB1ENR1_TIM2EN               (1 << 0)  /* Bit 0: TIM2 clock enable */
#define RCC_APB1ENR1_TIM3EN               (1 << 1)  /* Bit 1: TIM3 clock enable */
#define RCC_APB1ENR1_TIM4EN               (1 << 2)  /* Bit 2: TIM4 clock enable */
#define RCC_APB1ENR1_TIM5EN               (1 << 3)  /* Bit 3: TIM5 clock enable */
#define RCC_APB1ENR1_TIM6EN               (1 << 4)  /* Bit 4: TIM6 clock enable */
#define RCC_APB1ENR1_TIM7EN               (1 << 5)  /* Bit 5: TIM7 clock enable */
#define RCC_APB1ENR1_WWDGEN               (1 << 11) /* Bit 11: WWDG clock enable */
#define RCC_APB1ENR1_SPI2EN               (1 << 14) /* Bit 14: SPI2 clock enable */
#define RCC_APB1ENR1_USART2EN             (1 << 17) /* Bit 17: USART2 clock enable */
#define RCC_APB1ENR1_USART3EN             (1 << 18) /* Bit 18: USART3 clock enable */
#define RCC_APB1ENR1_USART4EN             (1 << 19) /* Bit 19: USART4 clock enable */
#define RCC_APB1ENR1_USART5EN             (1 << 20) /* Bit 20: USART5 clock enable */
#define RCC_APB1ENR1_I2C1EN               (1 << 21) /* Bit 21: I2C1 clock enable */
#define RCC_APB1ENR1_I2C2EN               (1 << 22) /* Bit 22: I2C2 clock enable */
#define RCC_APB1ENR1_CRSEN                (1 << 24) /* Bit 24: CRSEN clock enable */

/* APB1 Peripheral Clock enable register 2 */

#define RCC_APB1ENR2_I2C4EN               (1 << 1)  /* Bit 1: I2C4 clock enable */
#define RCC_APB1ENR2_LPTIM2EN             (1 << 5)  /* Bit 5: LPTIM2 clock enable */
#define RCC_APB1ENR2_FDCAN1EN             (1 << 9)  /* Bit 9: FDCAN1EN clock enable */
#define RCC_APB1ENR2_UCPD1EN              (1 << 23) /* Bit 23: UCPD1EN clock enable */

/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_TIM1EN               (1 << 11) /* Bit 11: TIM1 clock enable */
#define RCC_APB2ENR_SPI1EN               (1 << 12) /* Bit 12: SPI1 clock enable */
#define RCC_APB2ENR_TIM8EN               (1 << 13) /* Bit 13: TIM8 clock enable */
#define RCC_APB2ENR_USART1EN             (1 << 14) /* Bit 14: USART1 clock enable */
#define RCC_APB2ENR_TIM15EN              (1 << 16) /* Bit 16: TIM15 clock enable */
#define RCC_APB2ENR_TIM16EN              (1 << 17) /* Bit 17: TIM16 clock enable */
#define RCC_APB2ENR_TIM17EN              (1 << 18) /* Bit 18: TIM17 clock enable */
#define RCC_APB2ENR_SAI1EN               (1 << 21) /* Bit 21: SAI1 clock enable */
#define RCC_APB2ENR_SAI2EN               (1 << 22) /* Bit 22: SAI2 clock enable */

/* APB3 Peripheral Clock enable register */

#define RCC_APB3ENR_SYSCFGEN             (1 << 1)  /* Bit 1: SYSCFG clock enable */
#define RCC_APB3ENR_SPI3EN               (1 << 5)  /* Bit 5: SPI3 clock enable */
#define RCC_APB3ENR_LPUART1EN            (1 << 6)  /* Bit 6: LPUART1 clock enable */
#define RCC_APB3ENR_I2C3EN               (1 << 7)  /* Bit 7: I2C3 clock enable */
#define RCC_APB3ENR_LPTIM1EN             (1 << 11) /* Bit 11: LPTIM1 clock enable */
#define RCC_APB3ENR_LPTIM3EN             (1 << 12) /* Bit 12: LPTIM3 clock enable */
#define RCC_APB3ENR_LPTIM4EN             (1 << 13) /* Bit 13: LPTIM4 clock enable */
#define RCC_APB3ENR_OPAMPEN              (1 << 14) /* Bit 14: OPAMP clock enable */
#define RCC_APB3ENR_COMPEN               (1 << 15) /* Bit 15: COMP clock enable */
#define RCC_APB3ENR_VREFEN               (1 << 20) /* Bit 20: VREF clock enable */
#define RCC_APB3ENR_RTCAPBEN             (1 << 21) /* Bit 21: RTC and TAMP APB clock enable */

/* Backup domain control register */

#define RCC_BDCR_LSEON                   (1 << 0)  /* Bit 0: External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY                  (1 << 1)  /* Bit 1: External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP                  (1 << 2)  /* Bit 2: External Low Speed oscillator Bypass */

#define RCC_BDCR_LSEDRV_SHIFT            (3)       /* Bits 3-4: LSE oscillator drive capability */
#define RCC_BDCR_LSEDRV_MASK             (3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW            (0 << RCC_BDCR_LSEDRV_SHIFT) /* 00: Lower driving capability */
#  define RCC_BDCR_LSEDRV_MEDLO          (1 << RCC_BDCR_LSEDRV_SHIFT) /* 01: Medium Low driving capability */
#  define RCC_BDCR_LSEDRV_MEDHI          (2 << RCC_BDCR_LSEDRV_SHIFT) /* 10: Medium High driving capability*/
#  define RCC_BDCR_LSEDRV_HIGH           (3 << RCC_BDCR_LSEDRV_SHIFT) /* 11: Higher driving capability */

